mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_apis.c
/**
 * @file jm_stm32_tone.c
 * @brief 蜂鸣器/音调、脉冲检测、移位寄存器、AT24CXX EEPROM、I2C 接口实现
 *
 * 使用寄存器直驱方式，无需 HAL 库。
 * 受 @ref JM_APIS_ENABLE@ref JM_AT24CXX_ENABLE、
 * @ref JM_I2C_WRAPPER_ENABLE 宏控制编译。
 */

#include "jm_stm32.h"
#include "jm_stm32_com.h"

#if defined(USE_HAL_UART)
#include "stm32f1xx_hal.h"
#else
#include <stm32f1xx.h>
#endif

/** @brief 系统时钟频率（Hz） */
#define SYSTEM_CLOCK 72000000

/**
 * @brief 将引脚编号映射到 GPIO 端口
 * @param pin 引脚编号
 * @return 端口指针，无效返回 NULL
 */
static GPIO_TypeDef *pin_to_port(uint32_t pin) {
    if (pin < 16) return GPIOA;
    else if (pin < 32) return GPIOB;
    return NULL;
}

/**
 * @brief 将引脚编号映射到引脚掩码
 * @param pin 引脚编号
 * @return 引脚掩码，无效返回 0
 */
static uint16_t pin_to_mask(uint32_t pin) {
    if (pin < 16) return (uint16_t)(1 << pin);
    else if (pin < 32) return (uint16_t)(1 << (pin - 16));
    return 0;
}

#if JM_APIS_ENABLE==1

/**
 * @brief 音调/PWM 信息结构
 *
 * 记录每个音调引脚对应的定时器和通道。
 */
typedef struct {
    uint32_t pin;            /**< 引脚编号 */
    GPIO_TypeDef *port;      /**< 所属端口 */
    uint16_t pinMask;        /**< 引脚掩码 */
    TIM_TypeDef *tim;        /**< 定时器 */
    uint8_t channel;         /**< 定时器通道 */
} tone_info_t;

static tone_info_t g_tone_infos[4] = {0};
static uint8_t g_tone_info_count = 0;

/**
 * @brief 查找指定引脚的音调信息
 * @param pin 引脚编号
 * @return 音调信息指针，未找到返回 NULL
 */
static tone_info_t *tone_find_info(uint32_t pin) {
    for (int i = 0; i < g_tone_info_count; i++) {
        if (g_tone_infos[i].pin == pin) {
            return &g_tone_infos[i];
        }
    }
    return NULL;
}

/**
 * @brief 分配一个音调信息结构
 * @param pin      引脚编号
 * @param port     端口指针
 * @param pinMask  引脚掩码
 * @param tim      定时器指针
 * @param channel  定时器通道
 * @return 音调信息指针，失败返回 NULL
 */
static tone_info_t *tone_alloc_info(uint32_t pin, GPIO_TypeDef *port, uint16_t pinMask, TIM_TypeDef *tim, uint8_t channel) {
    if (g_tone_info_count >= 4) return NULL;
    tone_info_t *info = &g_tone_infos[g_tone_info_count++];
    info->pin = pin;
    info->port = port;
    info->pinMask = pinMask;
    info->tim = tim;
    info->channel = channel;
    return info;
}



/**
 * @brief 将引脚映射到定时器和通道
 * @param pin    引脚编号
 * @param tim    输出：定时器指针
 * @param channel 输出：定时器通道
 */
static void pin_to_timer(uint32_t pin, TIM_TypeDef **tim, uint8_t *channel) {
    *tim = NULL;
    *channel = 0;
    switch (pin) {
        case 0: *tim = TIM2; *channel = 1; break;
        case 1: *tim = TIM2; *channel = 2; break;
        case 2: *tim = TIM2; *channel = 3; break;
        case 3: *tim = TIM2; *channel = 4; break;
        case 6: *tim = TIM3; *channel = 1; break;
        case 7: *tim = TIM3; *channel = 2; break;
        case 8: *tim = TIM3; *channel = 3; break;
        case 9: *tim = TIM3; *channel = 4; break;
        default: break;
    }
}

/* ===================== 音调/PWM/移位/脉冲 ===================== */

/**
 * @brief 设置引脚为复用推挽输出（用于 PWM/音调）
 * @param pin 引脚编号
 */
static void tone_set_pin_af_pp(uint32_t pin) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    if (port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (pinMask & (1 << i)) { pin_no = i; break; }
    }

    if (pin_no < 8) {
        uint32_t cr_reg = port->CRL;
        cr_reg &= ~(0xF << (pin_no * 4));
        cr_reg |= (0xB << (pin_no * 4));
        port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = port->CRH;
        cr_reg &= ~(0xF << ((pin_no - 8) * 4));
        cr_reg |= (0xB << ((pin_no - 8) * 4));
        port->CRH = cr_reg;
    }
}

/**
 * @brief 设置引脚为输入模式
 * @param pin 引脚编号
 */
static void tone_set_pin_input(uint32_t pin) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    uint8_t pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (pinMask & (1 << i)) { pin_no = i; break; }
    }

    if (pin_no < 8) {
        uint32_t cr_reg = port->CRL;
        cr_reg &= ~(0xF << (pin_no * 4));
        cr_reg |= (0x1 << (pin_no * 4));
        port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = port->CRH;
        cr_reg &= ~(0xF << ((pin_no - 8) * 4));
        cr_reg |= (0x1 << ((pin_no - 8) * 4));
        port->CRH = cr_reg;
    }
}

/**
 * @brief 使能定时器时钟
 * @param tim 定时器指针
 */
static void tone_enable_clock(TIM_TypeDef *tim) {
    if (tim == TIM2) RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
    else if (tim == TIM3) RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;
}

static void noTone(uint32_t pin);

/**
 * @brief 播放音调
 * @param pin     引脚编号
 * @param freq    频率（Hz）
 * @param duration 持续时间（ms），0 表示持续播放
 */
static void tone(uint32_t pin, uint32_t freq, uint32_t duration) {
    if (freq == 0) return;

    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    TIM_TypeDef *tim;
    uint8_t channel;
    pin_to_timer(pin, &tim, &channel);
    if (!tim) return;

    tone_info_t *info = tone_find_info(pin);
    if (info) {
        info->tim->CR1 &= ~TIM_CR1_CEN;
    }

    tone_set_pin_af_pp(pin);
    tone_enable_clock(tim);

    uint32_t period = SYSTEM_CLOCK / freq;
    uint32_t psc = 0;
    uint32_t arr = period - 1;

    if (arr > 65535) {
        psc = period / 65536;
        if (psc == 0) psc = 1;
        arr = period / psc;
        if (arr > 65535) arr = 65535;
        if (arr == 0) arr = 1;
    }

    tim->CR1 = 0;
    tim->PSC = psc;
    tim->ARR = arr;
    tim->CCMR1 = 0;
    tim->CCMR2 = 0;
    tim->CCER = 0;

    uint32_t ccr = arr / 2;
    switch (channel) {
        case 1:
            tim->CCMR1 |= (0x6 << 4) | (1 << 3);
            tim->CCR1 = ccr;
            tim->CCER |= TIM_CCER_CC1E;
            break;
        case 2:
            tim->CCMR1 |= (0x6 << 12) | (1 << 11);
            tim->CCR2 = ccr;
            tim->CCER |= TIM_CCER_CC2E;
            break;
        case 3:
            tim->CCMR2 |= (0x6 << 4) | (1 << 3);
            tim->CCR3 = ccr;
            tim->CCER |= TIM_CCER_CC3E;
            break;
        case 4:
            tim->CCMR2 |= (0x6 << 12) | (1 << 11);
            tim->CCR4 = ccr;
            tim->CCER |= TIM_CCER_CC4E;
            break;
        default:
            return;
    }

    tim->CR1 |= TIM_CR1_CEN;

