mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_apis.c
    if (info == NULL) {
        info = tone_alloc_info(pin, port, pinMask, tim, channel);
    }

    if (duration > 0) {
        jm_delay_ms(duration);
        noTone(pin);
    }
}

/**
 * @brief 停止播放音调
 * @param pin 引脚编号
 */
static void noTone(uint32_t pin) {
    tone_info_t *info = tone_find_info(pin);
    if (info == NULL) return;

    info->tim->CR1 &= ~TIM_CR1_CEN;
    tone_set_pin_input(pin);
}

/**
 * @brief 设置引脚为普通输出模式
 * @param pin 引脚编号
 */
static void tone_set_pin_output(uint32_t pin) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    if (port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (pinMask & (1 << i)) { pin_no = i; break; }
    }

    if (pin_no < 8) {
        uint32_t cr_reg = port->CRL;
        cr_reg &= ~(0xF << (pin_no * 4));
        cr_reg |= (0x3 << (pin_no * 4));
        port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = port->CRH;
        cr_reg &= ~(0xF << ((pin_no - 8) * 4));
        cr_reg |= (0x3 << ((pin_no - 8) * 4));
        port->CRH = cr_reg;
    }
}

/**
 * @brief 读取脉冲信号持续时间（微秒）
 * @param pin        引脚编号
 * @param state      等待的电平状态
 * @param timeout_us 超时时间（微秒）
 * @return 脉冲持续时间（微秒），超时返回 0
 */
static uint32_t tone_pulseIn(uint32_t pin, uint8_t state, uint32_t timeout_us) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return 0;

    tone_set_pin_input(pin);

    uint32_t systick_ctrl = SysTick->CTRL;
    uint32_t systick_load = SysTick->LOAD;

    SysTick->LOAD = 0xFFFFFF;
    SysTick->VAL = 0;
    SysTick->CTRL = 5;

    uint32_t start = SysTick->VAL;
    while (((port->IDR & pinMask) ? 1 : 0) != state) {
        if ((start - SysTick->VAL) / 72 > timeout_us) {
            SysTick->CTRL = 0;
            SysTick->LOAD = systick_load;
            SysTick->VAL = 0;
            SysTick->CTRL = systick_ctrl;
            return 0;
        }
    }

    uint32_t pulse_start = SysTick->VAL;
    while (((port->IDR & pinMask) ? 1 : 0) == state) {
        if ((pulse_start - SysTick->VAL) / 72 > timeout_us) {
            SysTick->CTRL = 0;
            SysTick->LOAD = systick_load;
            SysTick->VAL = 0;
            SysTick->CTRL = systick_ctrl;
            return 0;
        }
    }

    uint32_t pulse_end = SysTick->VAL;

    SysTick->CTRL = 0;
    SysTick->LOAD = systick_load;
    SysTick->VAL = 0;
    SysTick->CTRL = systick_ctrl;

    uint32_t elapsed = (pulse_start >= pulse_end) ? (pulse_start - pulse_end) : (0x1000000 - pulse_end + pulse_start);
    return elapsed / 72;
}

/**
 * @brief 读取脉冲信号持续时间（长超时版本）
 * @param pin        引脚编号
 * @param state      等待的电平状态
 * @param timeout_us 超时时间（微秒）
 * @return 脉冲持续时间（微秒），超时返回 0
 */
static uint32_t tone_pulseInLong(uint32_t pin, uint8_t state, uint32_t timeout_us) {
    return tone_pulseIn(pin, state, timeout_us);
}

/**
 * @brief 从移位寄存器读取一个字节
 * @param dataPin   数据引脚编号
 * @param clockPin  时钟引脚编号
 * @param bitOrder  位序（0=LSB 优先，1=MSB 优先）
 * @return 读取的字节
 */
static uint8_t tone_shiftIn(uint32_t dataPin, uint32_t clockPin, uint8_t bitOrder) {
    uint8_t value = 0;
    uint8_t i;

    GPIO_TypeDef *clkPort = pin_to_port(clockPin);
    uint16_t clkMask = pin_to_mask(clockPin);
    GPIO_TypeDef *dataPort = pin_to_port(dataPin);
    uint16_t dataMask = pin_to_mask(dataPin);

    if (!clkPort || !dataPort) return 0;

    if (clkPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (clkPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (dataPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (dataPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    tone_set_pin_output(clockPin);
    tone_set_pin_input(dataPin);

    for (i = 0; i < 8; i++) {
        clkPort->BSRR = clkMask;

        if (dataPort->IDR & dataMask) {
            if (bitOrder == 0) {
                value |= (1 << i);
            } else {
                value |= (1 << (7 - i));
            }
        }

        clkPort->BSRR = ((uint32_t)clkMask << 16);
    }

    return value;
}

/**
 * @brief 向移位寄存器写入一个字节
 * @param dataPin   数据引脚编号
 * @param clockPin  时钟引脚编号
 * @param bitOrder  位序（0=LSB 优先，1=MSB 优先）
 * @param val       待写入的字节
 */
static void tone_shiftOut(uint32_t dataPin, uint32_t clockPin, uint8_t bitOrder, uint8_t val) {
    GPIO_TypeDef *clkPort = pin_to_port(clockPin);
    uint16_t clkMask = pin_to_mask(clockPin);
    GPIO_TypeDef *dataPort = pin_to_port(dataPin);
    uint16_t dataMask = pin_to_mask(dataPin);

    if (!clkPort || !dataPort) return;

    if (clkPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (clkPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (dataPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (dataPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    tone_set_pin_output(clockPin);
    tone_set_pin_output(dataPin);

    clkPort->BSRR = ((uint32_t)clkMask << 16);

    for (int i = 0; i < 8; i++) {
        uint8_t bit;
        if (bitOrder == 0) {
            bit = (val >> i) & 1;
        } else {
            bit = (val >> (7 - i)) & 1;
        }

        if (bit) {
            dataPort->BSRR = dataMask;
        } else {
            dataPort->BSRR = ((uint32_t)dataMask << 16);
        }

        clkPort->BSRR = clkMask;
        clkPort->BSRR = ((uint32_t)clkMask << 16);
    }
}
#endif // JM_APIS_ENABLE==1

#if JM_AT24CXX_ENABLE==1

/* ===================== AT24CXX EEPROM (I2C) ===================== */

#define EEPROM_I2C_ADDRESS 0x50  /**< AT24CXX I2C 设备地址 */
#define EEPROM_I2C_TIMEOUT 10000 /**< I2C 超时计数 */

static I2C_TypeDef *eeprom_i2c = I2C1;
static bool eeprom_i2c_inited = false;

static bool i2c_wait_sr1(uint32_t flag) {
    int timeout = EEPROM_I2C_TIMEOUT;
    while (!(eeprom_i2c->SR1 & flag)) {
        if (--timeout <= 0) return false;
    }
    return true;
}

static bool i2c_start(void) {
    eeprom_i2c->CR1 |= I2C_CR1_START;
    return i2c_wait_sr1(I2C_SR1_SB);
}

