mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_apis.c
static void i2c_stop(void) {
    eeprom_i2c->CR1 |= I2C_CR1_STOP;
}

static bool i2c_send_addr(uint8_t addr, bool read) {
    eeprom_i2c->DR = (addr << 1) | (read ? 1 : 0);
    return i2c_wait_sr1(I2C_SR1_ADDR);
}

static bool i2c_write_byte(uint8_t data) {
    eeprom_i2c->DR = data;
    return i2c_wait_sr1(I2C_SR1_TXE);
}

static uint8_t i2c_read_byte(bool ack) {
    if (!ack) eeprom_i2c->CR1 &= ~I2C_CR1_ACK;
    while (!(eeprom_i2c->SR1 & I2C_SR1_RXNE));
    return eeprom_i2c->DR;
}

/**
 * @brief 初始化 EEPROM 的 I2C 接口
 * @param sda SDA 引脚编号
 * @param scl SCL 引脚编号
 * @return true 成功
 */
static bool eeprom_i2c_init(uint8_t sda, uint8_t scl) {
    GPIO_TypeDef *sda_port = pin_to_port(sda);
    GPIO_TypeDef *scl_port = pin_to_port(scl);
    uint16_t sda_mask = pin_to_mask(sda);
    uint16_t scl_mask = pin_to_mask(scl);
    if (!sda_port || !scl_port) return false;

    if (sda_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (sda_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (scl_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (scl_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t sda_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (sda_mask & (1 << i)) { sda_pin_no = i; break; }
    }
    uint8_t scl_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (scl_mask & (1 << i)) { scl_pin_no = i; break; }
    }

    if (sda_pin_no < 8) {
        uint32_t cr_reg = sda_port->CRL;
        cr_reg &= ~(0xF << (sda_pin_no * 4));
        cr_reg |= (0xE << (sda_pin_no * 4));
        sda_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = sda_port->CRH;
        cr_reg &= ~(0xF << ((sda_pin_no - 8) * 4));
        cr_reg |= (0xE << ((sda_pin_no - 8) * 4));
        sda_port->CRH = cr_reg;
    }

    if (scl_pin_no < 8) {
        uint32_t cr_reg = scl_port->CRL;
        cr_reg &= ~(0xF << (scl_pin_no * 4));
        cr_reg |= (0xE << (scl_pin_no * 4));
        scl_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = scl_port->CRH;
        cr_reg &= ~(0xF << ((scl_pin_no - 8) * 4));
        cr_reg |= (0xE << ((scl_pin_no - 8) * 4));
        scl_port->CRH = cr_reg;
    }

    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

    RCC->APB1RSTR |= RCC_APB1RSTR_I2C1RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_I2C1RST;

    eeprom_i2c->CR1 = 0;
    eeprom_i2c->CR2 = 72;
    eeprom_i2c->CCR = 360;
    eeprom_i2c->TRISE = 73;
    eeprom_i2c->CR1 |= I2C_CR1_PE;

    eeprom_i2c_inited = true;
    return true;
}

/**
 * @brief 向 EEPROM 指定地址写入一个字节
 * @param addr 地址
 * @param data 数据
 * @return true 成功
 */
static bool eeprom_write_byte(uint16_t addr, uint8_t data) {
    if (!i2c_start()) return false;
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, false)) return false;
    if (!i2c_write_byte(addr >> 8)) return false;
    if (!i2c_write_byte(addr & 0xFF)) return false;
    if (!i2c_write_byte(data)) return false;
    i2c_stop();
    jm_delay_ms(10);
    return true;
}

/**
 * @brief 从 EEPROM 指定地址读取一个字节
 * @param addr 地址
 * @return 读取到的数据
 */
static uint8_t eeprom_read_byte(uint16_t addr) {
    if (!i2c_start()) return 0;
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, false)) return 0;
    if (!i2c_write_byte(addr >> 8)) return 0;
    if (!i2c_write_byte(addr & 0xFF)) return 0;

    i2c_start();
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, true)) return 0;

    uint8_t data = i2c_read_byte(false);
    i2c_stop();
    return data;
}

/**
 * @brief 从 EEPROM 指定地址读取多个字节
 * @param addr 起始地址
 * @param buf  输出缓冲区
 * @param len  读取长度
 * @return true 成功
 */
static bool eeprom_read_bytes(uint16_t addr, uint8_t *buf, uint8_t len) {
    if (!i2c_start()) return false;
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, false)) return false;
    if (!i2c_write_byte(addr >> 8)) return false;
    if (!i2c_write_byte(addr & 0xFF)) return false;

    i2c_start();
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, true)) return false;

    for (int i = 0; i < len; i++) {
        bool last = (i == len - 1);
        buf[i] = i2c_read_byte(!last);
    }
    i2c_stop();
    return true;
}

/**
 * @brief 扫描 I2C 总线上可能存在的 EEPROM 设备
 */
static void eeprom_scan_devices(void) {
    for (uint8_t addr = 8; addr < 120; addr++) {
        if (!i2c_start()) continue;
        i2c_send_addr(addr, false);
        i2c_stop();
    }
}

/**
 * @brief AT24CXX EEPROM 控制命令处理
 * @param ps emap 参数（op, addr, data 等）
 * @return 结果 emap，调用者需释放
 */
jm_emap_t* jm_stm32_at24cxx_call(jm_emap_t *ps) {
    jm_emap_t *rst = jm_emap_create(PREFIX_TYPE_STRINGG);
    jm_emap_putByte(rst, (void*)"code", 0, false);

    uint8_t op = (uint8_t)jm_emap_getInt(ps, (void*)"op", 0);

    switch(op) {
        case 54: {
            uint8_t sda = (uint8_t)jm_emap_getInt(ps, (void*)"d", 0);
            uint8_t scl = (uint8_t)jm_emap_getInt(ps, (void*)"c", 0);
            if(!eeprom_i2c_init(sda, scl)) {
                jm_emap_putByte(rst, (void*)"code", 1, false);
            }
        }
        break;

        case 55: {
            uint16_t addr = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t v = eeprom_read_byte(addr);
            jm_emap_putByte(rst, (void*)"v", (int8_t)v, false);
        }
        break;

        case 56: {
            uint16_t addra = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t d = (uint8_t)jm_emap_getByte(ps, (void*)"d", 0);
            if(!eeprom_write_byte(addra, d)) {
                jm_emap_putByte(rst, (void*)"code", 1, false);
            }
        }
        break;

        case 57: {
            uint16_t addrb = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t len = (uint8_t)jm_emap_getInt(ps, (void*)"s", 0);
            if(len <= 0 || len > 64) {
                jm_emap_putByte(rst, (void*)"code", 1, false);
            } else {
                uint8_t buf[64];
                if(!eeprom_read_bytes(addrb, buf, len)){
                    jm_emap_putByte(rst, (void*)"code", 3, false);
                } else {
                    for (int i = 0; i < len; i++) {
                        jm_emap_putByte(rst, (void*)"v", (int8_t)buf[i], false);
                    }
                }
            }
        }
        break;

        case 58: {
            uint16_t addrc = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t d = (uint8_t)jm_emap_getByte(ps, (void*)"d", 0);
            bool suc = eeprom_write_byte(addrc, d);
            jm_emap_putByte(rst, (void*)"v", suc ? 1 : 0, false);
        }
        break;

