mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_apis.c
        case 59: {
            eeprom_scan_devices();
        }
        break;

        default:
            jm_emap_putByte(rst, (void*)"code", 100, false);
    }

    return rst;
}

#endif // JM_AT24CXX_ENABLE==1

#if JM_I2C_WRAPPER_ENABLE==1

/* ===================== I2C Wrapper (Wire-like API) ===================== */

#define I2C_MAX_WIRES 4

typedef struct {
    uint16_t wireId;
    GPIO_TypeDef *sda_port;
    GPIO_TypeDef *scl_port;
    uint16_t sda_mask;
    uint16_t scl_mask;
    bool initialized;
    bool transmitting;
    uint8_t address;
    uint8_t *rx_buf;
    uint16_t rx_len;
    uint16_t rx_index;
} i2c_wire_t;

static i2c_wire_t i2c_wires[I2C_MAX_WIRES] = {0};
static uint8_t i2c_wire_count = 0;

static i2c_wire_t *i2c_find_wire(uint16_t wireId) {
    for (int i = 0; i < i2c_wire_count; i++) {
        if (i2c_wires[i].wireId == wireId) {
            return &i2c_wires[i];
        }
    }
    return NULL;
}

static i2c_wire_t *i2c_alloc_wire(uint16_t wireId) {
    if (i2c_wire_count >= I2C_MAX_WIRES) return NULL;
    i2c_wire_t *wire = &i2c_wires[i2c_wire_count++];
    wire->wireId = wireId;
    wire->initialized = false;
    wire->transmitting = false;
    wire->rx_buf = NULL;
    wire->rx_len = 0;
    wire->rx_index = 0;
    return wire;
}

static bool i2c_configure_pins(i2c_wire_t *wire) {
    uint8_t sda = wire->wireId & 0xFF;
    uint8_t scl = (wire->wireId >> 8) & 0xFF;

    wire->sda_port = pin_to_port(sda);
    wire->scl_port = pin_to_port(scl);
    wire->sda_mask = pin_to_mask(sda);
    wire->scl_mask = pin_to_mask(scl);
    if (!wire->sda_port || !wire->scl_port) return false;

    if (wire->sda_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (wire->sda_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (wire->scl_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (wire->scl_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t sda_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (wire->sda_mask & (1 << i)) { sda_pin_no = i; break; }
    }
    uint8_t scl_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (wire->scl_mask & (1 << i)) { scl_pin_no = i; break; }
    }

    if (sda_pin_no < 8) {
        uint32_t cr_reg = wire->sda_port->CRL;
        cr_reg &= ~(0xF << (sda_pin_no * 4));
        cr_reg |= (0xE << (sda_pin_no * 4));
        wire->sda_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = wire->sda_port->CRH;
        cr_reg &= ~(0xF << ((sda_pin_no - 8) * 4));
        cr_reg |= (0xE << ((sda_pin_no - 8) * 4));
        wire->sda_port->CRH = cr_reg;
    }

    if (scl_pin_no < 8) {
        uint32_t cr_reg = wire->scl_port->CRL;
        cr_reg &= ~(0xF << (scl_pin_no * 4));
        cr_reg |= (0xE << (scl_pin_no * 4));
        wire->scl_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = wire->scl_port->CRH;
        cr_reg &= ~(0xF << ((scl_pin_no - 8) * 4));
        cr_reg |= (0xE << ((scl_pin_no - 8) * 4));
        wire->scl_port->CRH = cr_reg;
    }

    return true;
}

static bool i2cw_wait_sr1(I2C_TypeDef *i2c, uint32_t flag, int timeout) {
    while (timeout--) {
        if (i2c->SR1 & flag) return true;
    }
    return false;
}

static bool i2cw_start(I2C_TypeDef *i2c) {
    i2c->CR1 |= I2C_CR1_START;
    return i2cw_wait_sr1(i2c, I2C_SR1_SB, 10000);
}

static void i2cw_stop(I2C_TypeDef *i2c) {
    i2c->CR1 |= I2C_CR1_STOP;
}

static bool i2cw_send_addr(I2C_TypeDef *i2c, uint8_t addr, bool read) {
    i2c->DR = (addr << 1) | (read ? 1 : 0);
    return i2cw_wait_sr1(i2c, I2C_SR1_ADDR, 10000);
}

static bool i2cw_write(I2C_TypeDef *i2c, uint8_t data) {
    i2c->DR = data;
    return i2cw_wait_sr1(i2c, I2C_SR1_TXE, 10000);
}

static uint8_t i2cw_read(I2C_TypeDef *i2c, bool ack) {
    if (!ack) i2c->CR1 &= ~I2C_CR1_ACK;
    while (!(i2c->SR1 & I2C_SR1_RXNE));
    return i2c->DR;
}

/**
 * @brief 初始化 I2C 总线
 * @param wireId  总线 ID（编码为 (scl<<8|sda)）
 * @param address 设备地址
 * @return 0 成功，-1 失败
 */
int8_t jm_i2c_begin(uint16_t wireId, uint8_t address) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire) wire = i2c_alloc_wire(wireId);
    if (!wire) return -1;

    if (!i2c_configure_pins(wire)) return -1;

    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;
    RCC->APB1RSTR |= RCC_APB1RSTR_I2C1RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_I2C1RST;

    I2C1->CR1 = 0;
    I2C1->CR2 = 72;
    I2C1->CCR = 360;
    I2C1->TRISE = 73;
    I2C1->CR1 |= I2C_CR1_PE;

    wire->initialized = true;
    wire->address = address;
    wire->transmitting = false;
    return 0;
}

/**
 * @brief 设置 I2C 时钟频率
 * @param wireId 总线 ID
 * @param clock  时钟频率（Hz）
 * @return 0 成功，-1 失败
 */
int8_t jm_i2c_set_clock(uint16_t wireId, uint32_t clock) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    uint32_t ccr = 72000000 / (2 * clock);
    I2C1->CCR = ccr;
    I2C1->TRISE = (72000000 / 1000000) + 1;
    return 0;
}

/**
 * @brief 开始 I2C 发送事务
 * @param wireId  总线 ID
 * @param address 设备地址
 * @return 0 成功，-1 失败
 */
int8_t jm_i2c_begin_transmission(uint16_t wireId, uint8_t address) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    wire->address = address;
    wire->transmitting = true;
    return 0;
}

/**
 * @brief 结束 I2C 发送事务
 * @param wireId    总线 ID
 * @param releaseBus 是否释放总线
 * @return 0 成功，-1 失败
 */
int8_t jm_i2c_end_transmission(uint16_t wireId, bool releaseBus) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    i2cw_stop(I2C1);
    wire->transmitting = false;
    return 0;
}

/**
 * @brief 请求从 I2C 设备读取数据
 * @param wireId  总线 ID
 * @param address 设备地址
 * @param size    请求读取的字节数
 * @param stop    是否发送停止信号
 * @return 读取的字节数，-1 表示失败
 */
int8_t jm_i2c_request_from(uint16_t wireId, uint8_t address, uint16_t size, bool stop) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    wire->address = address;
    wire->rx_len = size;
    wire->rx_index = 0;

