mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_apis.c
    if (!i2cw_start(I2C1)) return -1;
    if (!i2cw_send_addr(I2C1, address, true)) return -1;

    I2C1->CR1 |= I2C_CR1_ACK;

    if (stop) {
        wire->transmitting = false;
    }

    return size;
}

/**
 * @brief 向 I2C 总线写入一个字节
 * @param wireId 总线 ID
 * @param data   数据
 * @return 0 成功，-1 失败
 */
int8_t jm_i2c_write_byte(uint16_t wireId, uint8_t data) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    if (!i2cw_write(I2C1, data)) return -1;
    return 0;
}

/**
 * @brief 向 I2C 总线写入缓冲区数据
 * @param wireId 总线 ID
 * @param data   数据指针
 * @param size   数据长度
 * @return 写入的字节数，-1 表示失败
 */
int8_t jm_i2c_write_buffer(uint16_t wireId, const uint8_t *data, uint16_t size) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    for (uint16_t i = 0; i < size; i++) {
        if (!i2cw_write(I2C1, data[i])) return -1;
    }
    return size;
}

/**
 * @brief 查询 I2C 总线上可读的字节数
 * @param wireId 总线 ID
 * @return 可读字节数，-1 表示失败
 */
int8_t jm_i2c_available(uint16_t wireId) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    if (wire->rx_index < wire->rx_len) {
        return wire->rx_len - wire->rx_index;
    }
    return 0;
}

/**
 * @brief 从 I2C 总线读取数据
 * @param wireId  总线 ID
 * @param buffer  输出缓冲区
 * @param size    读取字节数
 * @return 读取的字节数，-1 表示失败
 */
int8_t jm_i2c_read(uint16_t wireId, uint8_t *buffer, uint16_t size) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    for (uint16_t i = 0; i < size; i++) {
        bool last = (i == size - 1);
        buffer[i] = i2cw_read(I2C1, !last);
    }

    if (wire->rx_index + size <= wire->rx_len) {
        wire->rx_index += size;
    }

    return (int8_t)size;
}

#endif // JM_I2C_WRAPPER_ENABLE==1

/**
 * @brief 默认控制命令处理
 *
 * 处理音调(tone)、脉冲检测(pulseIn)、移位寄存器(shiftIn/shiftOut)、
 * 中断控制、I2C 操作、EEPROM 操作等控制命令。
 *
 * @param ps emap 参数
 * @return 结果 emap，调用者需释放
 */
jm_emap_t *jm_stm32_ctrl_def(jm_emap_t *ps) {
    jm_emap_t *h = jm_emap_create(0);
    if (!h) return NULL;

    JM_LOG_D("ctrlTone");

    jm_emap_putInt(h, "code", 0, false);

    int8_t op = jm_emap_getInt(ps, "op", 0);
    
    switch (op) {
#if JM_APIS_ENABLE==1
        case 11: {
            uint32_t pin = jm_emap_getInt(ps, "p", 0);
            uint32_t freq = jm_emap_getInt(ps, "f", 0);
            uint32_t duration = jm_emap_getInt(ps, "d", 0);
            JM_LOG_D("tone pin=%d freq=%d dur=%d", pin, freq, duration);
            tone(pin, freq, duration);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 12: {
            uint32_t pin = jm_emap_getInt(ps, "p", 0);
            JM_LOG_D("noTone pin=%d", pin);
            noTone(pin);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }

        case 13:
        case 14: {
            uint32_t pin = jm_emap_getInt(ps, "p", 0);
            uint32_t state = jm_emap_getInt(ps, "s", 0);
            uint32_t timeout = jm_emap_getInt(ps, "t", 1000000);
            JM_LOG_D("pulseIn pin=%d state=%d timeout=%d", pin, state, timeout);
            uint32_t dur = (op == 13) ? tone_pulseIn(pin, state, timeout) : tone_pulseInLong(pin, state, timeout);
            jm_emap_putInt(h, "v", dur, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 15: {
            uint32_t dataPin = jm_emap_getInt(ps, "p", 0);
            uint32_t clockPin = jm_emap_getInt(ps, "c", 0);
            uint32_t bitOrder = jm_emap_getInt(ps, "b", 1);
            JM_LOG_D("shiftIn dataPin=%d clockPin=%d bitOrder=%d", dataPin, clockPin, bitOrder);
            uint8_t val = tone_shiftIn(dataPin, clockPin, (uint8_t)bitOrder);
            jm_emap_putInt(h, "v", val, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 16: {
            uint32_t dataPin = jm_emap_getInt(ps, "p", 0);
            uint32_t clockPin = jm_emap_getInt(ps, "c", 0);
            uint32_t bitOrder = jm_emap_getInt(ps, "b", 1);
            uint32_t val = jm_emap_getInt(ps, "v", 0);
            JM_LOG_D("shiftOut dataPin=%d clockPin=%d bitOrder=%d val=%d", dataPin, clockPin, bitOrder, val);
            tone_shiftOut(dataPin, clockPin, (uint8_t)bitOrder, (uint8_t)val);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_APIS_ENABLE==1

#if JM_STM32_INTERRUPT_ENABLE==1
        case 17: {
            JM_LOG_D("noInterrupts");
            __disable_irq();
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 18: {
            JM_LOG_D("interrupts");
            __enable_irq();
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_STM32_INTERRUPT_ENABLE==1

#if JM_I2C_WRAPPER_ENABLE==1
        case 45: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t address = (uint8_t)jm_emap_getInt(ps, "a", 0);
            int8_t ret = jm_i2c_begin(wireId, address);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 46: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint32_t clock = jm_emap_getInt(ps, "c", 100000);
            int8_t ret = jm_i2c_set_clock(wireId, clock);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 47: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t address = (uint8_t)jm_emap_getInt(ps, "a", 0);
            int8_t ret = jm_i2c_begin_transmission(wireId, address);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 48: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            bool releaseBus = jm_emap_getInt(ps, "r", 1) ? true : false;
            int8_t ret = jm_i2c_end_transmission(wireId, releaseBus);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 49: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t address = (uint8_t)jm_emap_getInt(ps, "a", 0);
            uint16_t size = jm_emap_getInt(ps, "s", 0);
            bool stop = jm_emap_getInt(ps, "p", 1) ? true : false;
            int8_t ret = jm_i2c_request_from(wireId, address, size, stop);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 50: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t data = (uint8_t)jm_emap_getInt(ps, "d", 0);
            int8_t ret = jm_i2c_write_byte(wireId, data);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 51: {
            uint16_t size = jm_emap_getInt(ps, "s", 0);
            jm_emap_putInt(h, "v", size, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 52: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            int8_t ret = jm_i2c_available(wireId);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 53: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint16_t size = jm_emap_getInt(ps, "s", 0);
            uint8_t buf[64];
            int8_t ret = jm_i2c_read(wireId, buf, size);
            if (ret > 0) {
                for (uint16_t i = 0; i < size && i < 64; i++) {
                    jm_emap_putByte(h, "v", (int8_t)buf[i], false);
                }
            }
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_I2C_WRAPPER_ENABLE==1

#if JM_AT24CXX_ENABLE==1
        case 54:
        case 55:
        case 56:
        case 57:
        case 58:
        case 59:
        {
            jm_emap_t *at24rst = jm_stm32_at24cxx_call(ps);
            if (at24rst) {
                jm_emap_putInt(h, "code", (int32_t)jm_emap_getByte(at24rst, (void*)"code", 0), false);
                if (jm_emap_exist(at24rst, (void*)"v")) {
                    jm_emap_putInt(h, "v", jm_emap_getInt(at24rst, (void*)"v", 0), false);
                }
                jm_emap_release(at24rst);
            }
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_AT24CXX_ENABLE==1

        default: {
            jm_emap_putInt(h, "code", 1, false);
            jm_emap_putStr(h, "msg", "Invalid op code", false, false);
            break;
        }
    }

    return h;
}

